# Eleman İşlemleri

In [2]:
import numpy as np

In [11]:
import pandas as pd

In [3]:
s1 = np.random.randint(10, size = 5)

In [4]:
s2 = np.random.randint(10, size = 5)

In [5]:
s3 = np.random.randint(10, size = 5)

In [7]:
sozluk = {"var1" : s1, "var2": s2, "var3": s3}

In [8]:
sozluk

{'var1': array([8, 2, 9, 1, 0]),
 'var2': array([6, 1, 7, 4, 1]),
 'var3': array([2, 5, 9, 3, 2])}

In [12]:
df = pd.DataFrame(sozluk)

In [13]:
df

   var1  var2  var3
0     8     6     2
1     2     1     5
2     9     7     9
3     1     4     3
4     0     1     2

In [14]:
df[0:1]

   var1  var2  var3
0     8     6     2

In [15]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df.index = ["a", "b", "c", "d", "e"]

In [17]:
df

   var1  var2  var3
a     8     6     2
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [19]:
df["c": "e"]

   var1  var2  var3
c     9     7     9
d     1     4     3
e     0     1     2

In [20]:
# silme

In [21]:
df.drop("a", axis = 0)

   var1  var2  var3
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [22]:
df

   var1  var2  var3
a     8     6     2
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [23]:
df.drop("a", axis = 0 , inplace = True )

In [24]:
df

   var1  var2  var3
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [25]:
# fancy

In [26]:
l = ["c", "e"]

In [27]:
df.drop(l, axis = 0)

   var1  var2  var3
b     2     1     5
d     1     4     3

In [28]:
# değişkenler için

In [29]:
"var1" in df

True

In [30]:
l = ["var1", "var4", "var2"]

In [32]:
for i in l:
    print(i in df)

True
False
True

In [33]:
df

   var1  var2  var3
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [35]:
df["var4"] = df["var1"]  / df["var2"]

In [36]:
df

   var1  var2  var3      var4
b     2     1     5  2.000000
c     9     7     9  1.285714
d     1     4     3  0.250000
e     0     1     2  0.000000

In [37]:
# değişken silmek

In [38]:
df.drop("var4", axis = 1)

   var1  var2  var3
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [39]:
df

   var1  var2  var3      var4
b     2     1     5  2.000000
c     9     7     9  1.285714
d     1     4     3  0.250000
e     0     1     2  0.000000

In [40]:
df.drop("var4", axis = 1, inplace = True)

In [41]:
df

   var1  var2  var3
b     2     1     5
c     9     7     9
d     1     4     3
e     0     1     2

In [42]:
l = ["var1", "var2"]

In [43]:
df.drop(l ,axis = 1)

   var3
b     5
c     9
d     3
e     2